In [2]:
import numpy as np
import pandas as pd

# Handling Missing Value

In [3]:
string_data = pd.Series(['aardvark', 'artichoke', np.nan, 'avocado'])

In [4]:
string_data.isnull()

0    False
1    False
2     True
3    False
dtype: bool

In [5]:
string_data.notnull()

0     True
1     True
2    False
3     True
dtype: bool

In [6]:
# new object - dropna()
string_data.dropna()

0     aardvark
1    artichoke
3      avocado
dtype: object

In [7]:
string_data

0     aardvark
1    artichoke
2          NaN
3      avocado
dtype: object

In [10]:
# new object - fillna()
string_data.fillna('null')

0     aardvark
1    artichoke
2         null
3      avocado
dtype: object

In [9]:
string_data

0     aardvark
1    artichoke
2          NaN
3      avocado
dtype: object

# Filtering Out Missing Data

In [11]:
string_data.dropna()

0     aardvark
1    artichoke
3      avocado
dtype: object

equivalent to the following:

In [12]:
string_data[string_data.notnull()]

0     aardvark
1    artichoke
3      avocado
dtype: object

In [13]:
cleaned = string_data.dropna()

In [14]:
cleaned

0     aardvark
1    artichoke
3      avocado
dtype: object

In [16]:
data = pd.DataFrame([[1., 6.5, 3.], [1., np.nan, np.nan],
                     [np.nan, np.nan, np.nan], [np.nan, 6.5, 3.]])

In [17]:
data

     0    1    2
0  1.0  6.5  3.0
1  1.0  NaN  NaN
2  NaN  NaN  NaN
3  NaN  6.5  3.0

dropna(how, thred)

In [18]:
cleaned1 = data.dropna(how='any') # default

In [19]:
cleaned1

     0    1    2
0  1.0  6.5  3.0

In [22]:
cleaned2 = data.dropna(how='all') # drop when all the inputs are NA
cleaned2

     0    1    2
0  1.0  6.5  3.0
1  1.0  NaN  NaN
3  NaN  6.5  3.0

In [23]:
cleaned3 = data.dropna(axis=1, how='all') # drop when the columns all NA
cleaned3

     0    1    2
0  1.0  6.5  3.0
1  1.0  NaN  NaN
2  NaN  NaN  NaN
3  NaN  6.5  3.0

In [24]:
cleaned4 = data.dropna(thresh=2) # drop the rows with 2 or more NAs

In [25]:
cleaned4

     0    1    2
0  1.0  6.5  3.0
3  NaN  6.5  3.0

In [28]:
_ = data.dropna(thresh=2, inplace=True)

In [29]:
data

     0    1    2
0  1.0  6.5  3.0
3  NaN  6.5  3.0